Repository: ist-dsi/wp-jquery-ui-slider-captcha
Catalog: langs/slider_captcha-*.po
Languages: pt_pt

source: None selected
pt_pt: Nenhum selecionado

source: To custumize the Slider CAPTCHA you must go to the Slider CAPTCHA's settings panel and change the layout.
pt_pt: Para modificar o Slider CAPTCHA, deve ir ao painel de definições do slider e alterar as opções de visualização.

source: Copy this code and paste it into the form on the left.
pt_pt: Copie este código e cole-o no formulário à esquerda.

source: Invalid CAPTCHA value.
pt_pt: Valor do CAPTCHA inválido.

source: <strong>ERROR:</strong> Something went wrong with the CAPTCHA validation. Please make sure you have JavaScript enabled on your browser.
pt_pt: <strong>ERRO</strong>: Aconteceu um problema com a validação do CAPTCHA. Por favor, verifique se tem o Javascript activo no seu navegador.

source: General
pt_pt: Geral

source: Comments form
pt_pt: Formulário de comentários

source: Registration form
pt_pt: Formulário de registo

source: Reset password form
pt_pt: Formulário de password perdida

source: Login form
pt_pt: Formulário de login

source: Custom form
pt_pt: Formulário personalizado

source: Slider CAPTCHA Settings
pt_pt: Definições do Slider CAPTCHA

source: All the settings have been successfully saved.
pt_pt: Todas as definições foram gravadas com sucesso.

source: By default the only place were the slider is applied is in the comments form. If you want to activate the slider for other kinds of forms (registration form, reset password form, login form or others) you need to activate them individually. The general settings apply to all kinds of forms. If you want to customize a slider for a specific kind of form you can do it. You just need to sellect the type of form (under "Slider options") and change the settings.
pt_pt: Por omissão, o slider é apenas aplicado ao formulário de comentários. Se deseja activar o slider para outro tipo de formulários (registo, recuperação de password, login ou outros) deve ativa-lo individualmente. As definições gerais aplicam-se a todos os formulários. Se deseja personalizar um slider para um determinado tipo de formulário também é possível: basta seleccionar o tipo de formulário (Em "Opções de Slider") e mudar as definições.

source: Slider options
pt_pt: Opções de Slider

source: %s activation
pt_pt: Activação de %s

source: Enabled
pt_pt: Activo

source: Disabled
pt_pt: Inactivo

source: Type
pt_pt: Tipo

source: Filled
pt_pt: Preenchido

source: Animation type
pt_pt: Tipo de animação

source: Overlap text
pt_pt: Texto de sobreposição

source: Swipe text
pt_pt: Texto de arrasto

source: Swipe & overlap text
pt_pt: Texto de sobreposição & arrasto

source: Dimensions
pt_pt: Tamanhos

source: Width
pt_pt: Largura

source: height:
pt_pt: altura:

source: px (or %)
pt_pt: px (ou %)

source: Hint text
pt_pt: Texto de ajuda

source: Before unlock
pt_pt: Antes de desbloquear

source: Swipe to Unlock
pt_pt: Arrastar para Validar

source: and after unlock
pt_pt: e depois de desbloquear

source: Unlocked
pt_pt: Desbloqueado

source: Styles
pt_pt: Estilos

source: Background color
pt_pt: Cor de fundo

source: Hint text size
pt_pt: Tamanho do texto de ajuda

source: Knob color
pt_pt: Cor do botão

source: Icon
pt_pt: Ícone

source: Icon color
pt_pt: Cor do ícone

source: Knob text size
pt_pt: Tamanho do texto do puxador

source: Icon position ( top &times; right)
pt_pt: Posição do ícone ( topo &times; direita)

source: Hint text color
pt_pt: Cor do texto de ajuda

source: After unlock
pt_pt: Depois de desbloquear

source: Live preview
pt_pt: Pré-visualização

source: This preview may differ from the one published on your website. Since the styles of the theme may override the settings of the plugin you should always check the slider appearance by browsing a page that requires validation.
pt_pt: Esta pré-visualização pode ser diferente da publicada no seu website. Uma vez que os estilos do tema podem sobrepor-se às definições do plugin, deve sempre verificar a aparência do slider navegando para uma página que requeira validação.

source: Do you want to <a href="#">test slider CAPCTHA again</a>?
pt_pt: Deseja <a href="#">experimentar o slider CAPTCHA novamente</a>?

source: Export options
pt_pt: Opções de exportação

source: You can copy the code of this custom slider, and apply it wherever you want. You have three options: php code, JavaScript code and shortcode. This last one can be inserted into content editor, while the others should be placed into theme templates.
pt_pt: Pode copiar o código deste slider personalizado e aplicá-lo onde desejar. Tem três opções: código php, código JavaScript e shortcode. Este último pode ser inserido no editor de conteúdos, enquanto que os outros devem ser colocados nos templates do tema.

source: php code
pt_pt: Código php

source: JavaScript code
pt_pt: Código JavaScript

source: Swipe to save changes
pt_pt: Arrastar para guardar alterações

source: Saving changes
pt_pt: Guardando alterações
